#Вариант 15.
#Дано целое число N (>0), являющееся некоторой степенью числа 2: N = 2K.
# Найти целое число K — показатель этой степени.
def find_power_simple():

    #Вводим число N
    try:
        N = int(input("Введите степень двойки N: "))
        if N <= 0:
            print("Число должно быть положительным!")
            return
    except ValueError:
        print("Ошибка ввода!")
        return
    #Проверяем, является ли число степенью двойки
    if (N & (N - 1)) != 0:
        print(f"Число {N} не является степенью двойки!")
        return
    #Находим число К(показатель степени)
    K = 0
    current = N
    while current > 1:
        current //= 2
        K += 1
    print(f"{N} = 2^{K}")
#Вызов
if __name__ == "__main__":
    find_power_simple()