# Вариант 15,часть2
# Даны целочисленные координаты точки на плоскости.
# Если точка совпадает с началом координат, то вывести 0.
# Если точка не совпадает с началом координат, но лежит на оси OX или OY, то вывести соответственно 1 или 2.
# Если точка не лежит на координатных осях, то вывести 3.

x = input("Введите координату X: ")
y = input("Введите координату Y: ")

# Обработка исключений для координаты X
while type(x) != int:
    try:
        x = int(x)
    except ValueError:
        print("Неправильно ввели координату X!")
        x = input("Введите координату X: ")

# Обработка исключений для координаты Y
while type(y) != int:
    try:
        y = int(y)
    except ValueError:
        print("Неправильно ввели координату Y!")
        y = input("Введите координату Y: ")

# Определение положения точки
if x == 0 and y == 0:
    print(0)  # Точка в начале координат
elif x == 0 and y != 0:
    print(1)  # Точка на оси OY
elif x != 0 and y == 0:
    print(2)  # Точка на оси OX
else:
    print(3)  # Точка не на координатных осях