# Вариант15.
# Даны три целых числа: A, B, C.
# Проверить истинность высказывания: «Ровно одно из чисел A, B, C положительное».
#Часть1.
a, b, c = input("Введите первое число: "), input("Введите второе число: "), input("Введите третье число: ")

# Обработка исключений для первого числа
while type(a) != int:
    try:
        a = int(a)
    except ValueError:
        print("Неправильно ввели!")
        a = input("Введите первое число: ")

# Обработка исключений для второго числа
while type(b) != int:
    try:
        b = int(b)
    except ValueError:
        print("Неправильно ввели!")
        b = input("Введите второе число: ")

# Обработка исключений для третьего числа
while type(c) != int:
    try:
        c = int(c)
    except ValueError:
        print("Неправильно ввели!")
        c = input("Введите третье число: ")

# Проверка условия: ровно одно число положительное
# Это означает, что только одно число > 0, а остальные два <= 0
condition = (a > 0 and b <= 0 and c <= 0) or \
           (a <= 0 and b > 0 and c <= 0) or \
           (a <= 0 and b <= 0 and c > 0)

print("Ровно одно из чисел A, B, C положительное:", condition)
