#Вариант15.
#Дан прямоугольник, длины сторон которого равны натуральным числам А и В. Составить функцию,
# которая будет находить на сколько квадратов можно разрезать данный прямоугольник,
# если от него каждый раз отрезать квадрат наибольшей площади.
def squares(a, b):
    count = 0
    while a > 0 and b > 0:
        if a >= b:
            count = count + (a // b)
            a = a % b
        else:
            count = count + (b // a)
            b = b % a
    return count

A = input("A = ")
A = int(A)
B = input("B = ")
B = int(B)
print("Количество квадратов:", {squares(A, B)})