# Вариант 15. Дано трехзначное число. Вывести вначале его последнюю цифру
# (единицы), а затем — его среднюю цифру (десятки) .
try:
    # Введи трехзначное число.
    number = int(input("Введите трехзначное число: "))
    # Находим последнюю цифру от числа.
    last_digit = number % 10
    # Находим среднюю цифру от числа.
    middle_digit = (number // 10) % 10
    # Результаты.
    print("Последняя цифра (единицы):", last_digit)
    print("Средняя цифра (десятки):", middle_digit)
except ValueError:
    print("Ошибка: Введите целое число!")
